; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v8)
		(pred_1 ?v1)
		(pred_6 ?v3)
		(pred_5 ?v3)
		(pred_3 ?v1 ?v3)
		(pred_2)
		(pred_4 ?v1))

   (:action op_2
       :parameters  (?v5 ?v6)
       :precondition (and (not-eq ?v5 ?v6) 
                          (pred_6 ?v5) (pred_6 ?v6) (pred_5 ?v5))
       :effect (and  (pred_5 ?v6)
		     (not (pred_5 ?v5))))


   (:action op_1
       :parameters (?v2 ?v4)
       :precondition  (and  (pred_1 ?v2) (pred_6 ?v4)
			    (pred_3 ?v2 ?v4) (pred_5 ?v4) (pred_2))
       :effect (and (pred_4 ?v2)
		    (not (pred_3 ?v2 ?v4)) 
		    (not (pred_2))))

   (:action op_3
       :parameters  (?v2  ?v4)
       :precondition  (and  (pred_1 ?v2) (pred_6 ?v4)
			    (pred_4 ?v2) (pred_5 ?v4))
       :effect (and (pred_3 ?v2 ?v4)
		    (pred_2)
		    (not (pred_4 ?v2)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_02 obj_04 obj_06 obj_07 obj_08 
          obj_05 obj_01 obj_03 
)
(:init
(pred_6 obj_02)
(pred_6 obj_04)
(pred_6 obj_06)
(pred_6 obj_07)
(pred_6 obj_08)
(pred_1 obj_05)
(pred_1 obj_01)
(pred_1 obj_03)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_07)
(pred_2)
(pred_3 obj_05 obj_08)
(pred_3 obj_01 obj_04)
(pred_3 obj_03 obj_07)
(pred_5 obj_07)
)
(:goal
(and
(pred_3 obj_05 obj_04)
(pred_3 obj_01 obj_06)
(pred_3 obj_03 obj_07)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_05 obj_04) (pred_5 obj_02))
    (sometime-before  (pred_3 obj_01 obj_06) (pred_5 obj_02))
  )
)
)

; plan
1. (op_2 obj_07 obj_08)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_08)
   goals met: 1 of 3
2. (op_1 obj_05 obj_08)
   deleted: (pred_3 obj_05 obj_08) (pred_2)
   added: (pred_4 obj_05)
   goals met: 1 of 3
3. (op_2 obj_08 obj_02)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_02)
   goals met: 1 of 3
4. (op_3 obj_05 obj_02)
   deleted: (pred_4 obj_05)
   added: (pred_3 obj_05 obj_02) (pred_2)
   goals met: 1 of 3
5. (op_2 obj_02 obj_04)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_04)
   goals met: 1 of 3
6. (op_1 obj_01 obj_04)
   deleted: (pred_3 obj_01 obj_04) (pred_2)
   added: (pred_4 obj_01)
   goals met: 1 of 3
7. (op_2 obj_04 obj_06)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_06)
   goals met: 1 of 3
8. (op_3 obj_01 obj_06)
   deleted: (pred_4 obj_01)
   added: (pred_3 obj_01 obj_06) (pred_2)
   goals met: 2 of 3
9. (op_2 obj_06 obj_02)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_02)
   goals met: 2 of 3
10. (op_1 obj_05 obj_02)
   deleted: (pred_3 obj_05 obj_02) (pred_2)
   added: (pred_4 obj_05)
   goals met: 2 of 3
11. (op_2 obj_02 obj_04)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_04)
   goals met: 2 of 3
12. (op_3 obj_05 obj_04)
   deleted: (pred_4 obj_05)
   added: (pred_3 obj_05 obj_04) (pred_2)
   goals met: 3 of 3
